# Добавьте в пакет, созданный на семинаре, шахматный модуль.
# Внутри него напишите код, решающий задачу о 8 ферзях.
# Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били друг друга.
# Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга.
# Программа получает на вход восемь пар чисел, каждое число от 1 до 8 - координаты 8 ферзей.
# Если ферзи не бьют друг друга верните истину, а если бьют - ложь.

from homework6_modules import main_ent

main_ent()

# Введите координаты 1-го ферзя через пробел: 1 1
# Введите координаты 2-го ферзя через пробел: 2 6
# Введите координаты 3-го ферзя через пробел: 3 8
# Введите координаты 4-го ферзя через пробел: 4 3
# Введите координаты 5-го ферзя через пробел: 5 7
# Введите координаты 6-го ферзя через пробел: 6 4
# Введите координаты 7-го ферзя через пробел: 7 2
# Введите координаты 8-го ферзя через пробел: 8 5
