# Напишите функцию группового переименования файлов. Она должна:
# * принимать параметр желаемое конечное имя файлов,
#   при переименовании в конце имени добавляется порядковый номер;
# * принимать параметр количество цифр в порядковом номере;
# * принимать параметр расширение исходного файла,
#   переименование должно работать только для этих файлов внутри каталога;
# * принимать параметр расширение конечного файла;
# * принимать диапазон сохраняемого оригинального имени; например,
#   для диапазона [3, 6] берутся буквы с 3 по 6 из исходного имени файла,
#   к ним прибавляется желаемое конечное имя, если оно передано;
#   далее счётчик файлов и расширение.


